In [1]:
import pandas as pd # 파이썬 라이브러리 -> 데이터 수정 및 변경

In [5]:
data_frame = pd.read_csv('data/friend_list.csv')

In [6]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [7]:
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [8]:
type(data_frame)

pandas.core.frame.DataFrame

In [9]:
type(data_frame.job)   # 시리즈는 파이썬의 리스트로 생성 가능하다
                      # 데이터 프레임의 각 열은 시리즈로 이루어져 있다.

pandas.core.series.Series

In [10]:
s1 = pd.core.series.Series([1,2,3])

In [11]:
s2 = pd.core.series.Series(['one', 'two', 'three'])

In [14]:
pd.DataFrame(data = dict(num = s1, word = s2))

   num   word
0    1    one
1    2    two
2    3  three

In [16]:
import pandas as pd

In [17]:
df = pd.read_csv('data/friend_list.csv')

In [18]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [19]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [20]:
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [21]:
df.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [22]:
df.tail(3)

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [24]:
df = pd.read_csv('data/friend_list.txt')

In [25]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [26]:
df = pd.read_csv('data/friend_list_tab.txt')

In [27]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [28]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter = '\t')

In [29]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [30]:
s

In [31]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [32]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [33]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [34]:
df.columns = ['name','age', 'job']

In [35]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [36]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age','job'])

In [37]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [38]:
import pandas as pd

In [39]:
friend_dict_list = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]

In [40]:
df = pd.DataFrame(friend_dict_list)

In [41]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [42]:
df.head() # 딕셔너리 -> key 값의 순서가 보장 X

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [46]:
df= df[['name', 'job', 'age']]

In [47]:
df

   name      job  age
0  John  student   25
1  Nate  teacher   30

In [48]:
from collections import OrderedDict

In [53]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)

In [54]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [55]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [56]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher'],
    
]

In [57]:
column_name = ['name', 'age','job']

In [58]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [60]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [70]:
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [20, 30]],
    ['job', ['student', 'teacher']]
]

In [75]:
import pandas as pd
df = pd.DataFrame(dict(friend_list))

In [76]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [77]:
import pandas as pd

In [81]:
friends = [
    {'name' : 'John', 'age' : 20, 'job' : 'student'},
    {'name' : 'Jenny', 'age' : 30, 'job' : None},
    {'name' : 'Nate', 'age' : 24, 'job' : 'teacher'}
]
df = pd.DataFrame(friends)
df = df[['name', 'age', 'job']]

In [82]:
df

    name  age      job
0   John   20  student
1  Jenny   30     None
2   Nate   24  teacher

In [89]:
df.to_csv('friends.csv', index = False, header = False,  na_rep = '-')
# na_rep :: 빈 값을 해당 값으로 채워준다.

In [1]:
# 5강? 6강? 데이터프레임 행, 열 선택 및 필터링 하기 부터 다시 듣기!!

In [2]:
import pandas as pd

In [5]:
friend_list = [
    ["name", ['John', 'Jenny', 'Nate']],
    ['age',[20, 30,30]],
    ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [6]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [7]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [8]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [9]:
df = df[1:3]

In [10]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [11]:
friend_list = [
    ["name", ['John', 'Jenny', 'Nate']],
    ['age',[20, 30,30]],
    ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [12]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [13]:
df.loc[[0, 2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [14]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [15]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [17]:
df[(df.age>25) & (df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

In [21]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
    
]
df = pd.DataFrame.from_records(friend_list)

In [22]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [24]:
df.iloc[:, 0:2] # row는 전체, coloumn은 0, 1만

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [25]:
df.iloc[0:2, 0:2]

       0   1
0   John  20
1  Jenny  30

In [27]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [28]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [29]:
df_filtered = df[['name', 'age']]

In [30]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [31]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [32]:
df.filter(items =['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [33]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [36]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [38]:
df.filter(regex = 'b$', axis = 1) # 정규식 이용한 열 필터링

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [2]:
# 판다스 모듈을 사용해 exam 파일을 exam(변수명)에 저장하세요.
import pandas as pd
import numpy as np
exam = pd.read_csv('exam.csv')

In [3]:
# 과학 과목에 대한 평균을 구하세요.
print('원래 과학 평균 : ', exam['science'].mean())

원래 과학 평균 :  59.45

In [4]:
# 인덱스 값이 3, 7, 12인 행의 과학 점수만 NaN 값으로 대체하세요.
# (밑줄 부분의 코드를 완성하세요)
exam.loc[[3,7,12],['science']] = np.nan

In [5]:
# NaN에 해당되는 값을 0으로 대체하고 과학 과목의 평균을 구하세요.
exam['science'] = exam['science'].fillna(0) #fillna na값을 채운다.
print('nan 값을 0으로 대체한 평균 : ', exam['science'].mean())

nan 값을 0으로 대체한 평균 :  52.05

In [6]:
# 다시 인덱스 값이 3, 7, 12인 행의 과학 점수만 NaN 값으로 대체하세요.
# (밑줄 부분의 코드를 완성하세요)
exam.loc[[3,7,12],['science']] = np.nan

In [7]:
# nan 값이 삽입되기 전 상태에서 구한 과학 점수의 평균을
# 소수점 1의 자리에서 반올림한 수치를 구하고
# 해당 수치로 NaN 자리를 대체하라
exam['science'] = exam['science'].fillna(59)

In [10]:
# 다시 과학 과목의 평균을 구하고 출력하세요.
exam['science'].mean()

60.9

# 1조

In [12]:
import pandas as pd
import numpy as np

exam = pd.read_csv('exam.csv')


# 과학 과목에 대한 평균을 구하세요.
science_mean_first = exam.science.mean()
print(science_mean_first)

59.45

In [13]:
# 인덱스 값이 3, 7, 12인 행의 과학 점수만 NaN 값으로 대체하세요.
exam.loc[[3, 7, 12], 'science'] = np.nan

In [14]:
# NaN에 해당되는 값을 0으로 대체하고, 과학 과목의 평균을 구하세요.
exam.fillna(0, inplace = True)
science_mean_second = exam.science.mean()

print(science_mean_second)

52.05

In [15]:
# 다시 인덱스 값이 3, 7, 12인 행의 과학 점수만 NaN 값으로 대체하세요.
# (밑줄 부분의 코드를 완성하세요)
exam.loc[[3, 7, 12], 'science'] = np.nan

# nan 값이 삽입되기 전 상태에서 구한 과학 점수의 평균을
# 소수점 1의 자리에서 반올림한 수치를 구하고
# 해당 수치로 NaN 값을 대체하세요.
exam['science'] = exam.science.fillna(round(science_mean_first, 0))

# 다시 과학 과목의 평균을 구하세요.
science_mean_third = exam.science.mean()

print(science_mean_first) # 원래의 점수
print(science_mean_second) # 3, 7, 12 행의 과학 점수 0
print(science_mean_third) # 3, 7, 12 행의 과학 점수 평균

# NaN 값을 0으로 대체하는 것보다 평균값으로 대체하는 것이 원래의 값과의 오차가 적어진다.

59.45
52.05
60.9

In [16]:
import pandas as pd
import numpy as np

exam = pd.read_csv('exam.csv')

# 과학 과목에 대한 평균을 구하세요.

mean_science_init = exam['science'].mean()
print(mean_science_init)

59.45

In [17]:
# 인덱스 값이 3, 7, 12인 행의 과학 점수만 NaN 값으로 대체하세요.

exam.loc[[3, 7, 12], ['science']] = np.nan


# NaN에 해당되는 값을 0으로 대체하고, 과학 과목의 평균을 구하세요.

exam['science'] = exam['science'].fillna(0)

mean_science_change = exam['science'].mean()
print(mean_science_change)

52.05

In [20]:
# 다시 인덱스 값이 3, 7, 12인 행의 과학 점수만 NaN 값으로 대체하세요.

exam.loc[[3, 7, 12], ['science']] = np.nan

# nan 값이 삽입되기 전 상태에서 구한 과학 점수의 평균을
# 소수점 1의 자리에서 반올림한 수치를 구하고
# 해당 수치로 NaN 값을 대체하세요.

mean_science_round = round(mean_science_init)
print(mean_science_round)

59

In [21]:
exam['science'] = exam['science'].fillna(mean_science_round)

# 다시 과학 과목의 평균을 구하세요.

mean_science_final = exam['science'].mean()
print(mean_science_final)

60.9

In [22]:
#출력-----------------------
59.45  # 처음 과학 평균
52.05  # NaN값을 0으로 대체 후 평균
59     # 처음 과학 평균 반올림
60.9   # NaN값을 반올림한 평균으로 대체 후 평균

60.9

In [23]:
import pandas as pd
import numpy as np

exam=pd.read_csv("exam.csv")

# 과학 과목에 대한 평균을 구하세요.
mean_science = exam["science"].mean()
print(mean_science)

59.45

In [25]:
# 인덱스 값이 3, 7, 12인 행의 과학 점수만 NaN 값으로 대체하세요.
# (밑줄 부분의 코드를 완성하세요)
exam.at[3, 'science'] = np.nan
exam.at[7, 'science'] = np.nan
exam.at[12, 'science'] = np.nan
print(exam)

ValueError: Cannot assign nan to integer series

In [26]:
# NaN에 해당되는 값을 0으로 대체하고, 과학 과목의 평균을 구하세요.
exam=exam.fillna(0)
print(exam)

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [27]:
# 다시 인덱스 값이 3, 7, 12인 행의 과학 점수만 NaN 값으로 대체하세요.
# (밑줄 부분의 코드를 완성하세요)
#_____________________________ = np.____
exam.at[3, 'science'] = np.nan
exam.at[7, 'science'] = np.nan
exam.at[12, 'science'] = np.nan
print(exam)

ValueError: Cannot assign nan to integer series

In [29]:
# nan 값이 삽입되기 전 상태에서 구한 과학 점수의 평균을
# 소수점 1의 자리에서 반올림한 수치를 구하고
# 해당 수치로 NaN 값을 대체하세요.
#exam['science'] = ___________________________
mean_science=round(mean_science, 1)
exam=exam.fillna(mean_science)
print(mean_science)
print(exam)

59.5
    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58